Catalogs/Размеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Размеры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиапазонЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НижнееЗначение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерхнееЗначение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КостюмыИзолирующие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдеждаСпециальнаяЗащитная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредстваДерматологическиеЗащитные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредстваЗащитыГлаз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредстваЗащитыГоловы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредстваЗащитыКомплексные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредстваЗащитыЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредстваЗащитыНог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредстваЗащитыОргановДыхания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредстваЗащитыОргановСлуха</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредстваЗащитыОтПадения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредстваЗащитыРук</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Размеры/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.СредстваЗащитыОргановДыхания Тогда
		РеквизитЗначение = ПроверяемыеРеквизиты.Найти("Значение");
		Если РеквизитЗначение <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(РеквизитЗначение);
		КонецЕсли;
		РеквизитНижнееЗначение = ПроверяемыеРеквизиты.Найти("НижнееЗначение");
		Если РеквизитНижнееЗначение <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(РеквизитНижнееЗначение);
		КонецЕсли;
	КонецЕсли;
	
	Если ДиапазонЗначений Тогда
		РеквизитЗначение = ПроверяемыеРеквизиты.Найти("Значение");
		Если РеквизитЗначение <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(РеквизитЗначение);
		КонецЕсли;
	Иначе
		РеквизитНижнееЗначение = ПроверяемыеРеквизиты.Найти("НижнееЗначение");
		Если РеквизитНижнееЗначение <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(РеквизитНижнееЗначение);
		КонецЕсли;
		РеквизитВерхнееЗначение = ПроверяемыеРеквизиты.Найти("ВерхнееЗначение");
		Если РеквизитВерхнееЗначение <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(РеквизитВерхнееЗначение);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
